logs/backup_benchmark_20250709_173402/h3_0ms_1pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 17:34:48
Delay: 0ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 50 total requests
spawning thread #1: 5 total client(s). 50 total requests
spawning thread #2: 5 total client(s). 50 total requests
spawning thread #3: 5 total client(s). 50 total requests
spawning thread #4: 5 total client(s). 50 total requests
spawning thread #5: 5 total client(s). 50 total requests
spawning thread #6: 5 total client(s). 50 total requests
spawning thread #7: 5 total client(s). 50 total requests
spawning thread #8: 5 total client(s). 50 total requests
spawning thread #9: 5 total client(s). 50 total requests
spawning thread #10: 5 total client(s). 50 total requests
spawning thread #11: 5 total client(s). 50 total requests
spawning thread #12: 5 total client(s). 50 total requests
spawning thread #13: 5 total client(s). 50 total requests
spawning thread #14: 5 total client(s). 50 total requests
spawning thread #15: 5 total client(s). 50 total requests
spawning thread #16: 5 total client(s). 50 total requests
spawning thread #17: 5 total client(s). 50 total requests
spawning thread #18: 5 total client(s). 50 total requests
spawning thread #19: 5 total client(s). 50 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 333.76ms, 2996.16 req/s, 837.25KB/s
requests: 1000 total, 1000 started, 1000 done, 1000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 279.44KB (286147) total, 211.84KB (216923) headers (space savings 26.47%), 60.55KB (62000) data
UDP datagram: 738 sent, 645 received
                     min         max         mean         sd        +/- sd
time for request:     6.00ms    246.05ms     78.81ms     85.82ms    69.50%
time for connect:    19.48ms     85.75ms     61.96ms     23.15ms    74.00%
time to 1st byte:    68.34ms    276.68ms    123.84ms     77.83ms    76.00%
req/s           :      30.15      139.81       88.96       42.60    40.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 450 total requests
spawning thread #1: 5 total client(s). 450 total requests
spawning thread #2: 5 total client(s). 450 total requests
spawning thread #3: 5 total client(s). 450 total requests
spawning thread #4: 5 total client(s). 450 total requests
spawning thread #5: 5 total client(s). 450 total requests
spawning thread #6: 5 total client(s). 450 total requests
spawning thread #7: 5 total client(s). 450 total requests
spawning thread #8: 5 total client(s). 450 total requests
spawning thread #9: 5 total client(s). 450 total requests
spawning thread #10: 5 total client(s). 450 total requests
spawning thread #11: 5 total client(s). 450 total requests
spawning thread #12: 5 total client(s). 450 total requests
spawning thread #13: 5 total client(s). 450 total requests
spawning thread #14: 5 total client(s). 450 total requests
spawning thread #15: 5 total client(s). 450 total requests
spawning thread #16: 5 total client(s). 450 total requests
spawning thread #17: 5 total client(s). 450 total requests
spawning thread #18: 5 total client(s). 450 total requests
spawning thread #19: 5 total client(s). 450 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.08s, 8332.52 req/s, 2.29MB/s
requests: 9000 total, 9000 started, 9000 done, 9000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 9000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.47MB (2593475) total, 1.86MB (1952427) headers (space savings 26.46%), 544.92KB (558000) data
UDP datagram: 1592 sent, 3090 received
                     min         max         mean         sd        +/- sd
time for request:     1.75ms    603.53ms    290.72ms    176.38ms    57.01%
time for connect:    73.55ms       1.04s    124.22ms    186.98ms    96.00%
time to 1st byte:    81.64ms       1.04s    189.37ms    201.99ms    92.00%
req/s           :      83.52      424.08      145.70       44.00    87.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 1000
Measurement Requests: 9000
End Time: 2025-07-09 17:34:55
CSV Log: /logs/benchmark_20250709_173402/h3_0ms_1pct.csv